package demo.sql;

import java.util.Arrays;
import java.util.List;

public class SqlExecute {

    public static void run1(){
        String input1 = "19\n" +
                "59\n" +
                "82\n" +
                "83\n" +
                "97\n" +
                "102\n" +
                "104\n" +
                "107\n" +
                "108\n" +
                "112\n" +
                "134\n" +
                "138\n" +
                "139\n" +
                "143\n" +
                "146\n" +
                "147\n" +
                "190\n" +
                "207\n" +
                "222\n" +
                "228\n" +
                "230\n" +
                "231\n" +
                "232\n" +
                "259\n" +
                "260\n" +
                "268\n" +
                "271\n" +
                "273\n" +
                "274\n" +
                "279\n" +
                "280\n" +
                "282\n" +
                "283\n" +
                "296\n" +
                "297\n" +
                "298\n" +
                "303\n" +
                "314\n" +
                "315\n" +
                "317\n" +
                "321\n" +
                "325\n" +
                "334\n" +
                "335\n" +
                "340\n" +
                "341\n" +
                "342\n" +
                "346\n" +
                "347\n" +
                "354\n" +
                "373\n" +
                "380\n" +
                "381\n" +
                "385\n" +
                "386\n" +
                "387\n" +
                "388\n" +
                "390\n" +
                "403\n" +
                "422\n" +
                "429\n" +
                "437\n" +
                "441\n" +
                "447\n" +
                "459\n" +
                "465\n" +
                "466\n" +
                "467\n" +
                "469\n" +
                "471\n" +
                "472\n" +
                "473\n" +
                "475\n" +
                "484\n" +
                "488\n" +
                "489\n" +
                "503\n" +
                "504\n" +
                "507\n" +
                "508\n" +
                "510\n" +
                "513\n" +
                "515\n" +
                "516\n" +
                "520\n" +
                "525\n" +
                "526\n" +
                "555\n" +
                "568\n" +
                "569\n" +
                "571\n" +
                "588\n" +
                "596\n" +
                "598\n" +
                "599\n" +
                "605\n" +
                "607\n" +
                "609\n" +
                "610\n" +
                "616\n" +
                "621\n" +
                "623\n" +
                "634\n" +
                "638\n" +
                "640\n" +
                "652\n" +
                "655\n" +
                "665\n" +
                "666\n" +
                "667\n" +
                "668\n" +
                "672\n" +
                "678\n" +
                "689\n" +
                "696\n" +
                "697\n" +
                "702\n" +
                "703\n" +
                "704\n" +
                "715\n" +
                "717\n" +
                "723\n" +
                "729\n";
        String input2 = "替换为：Staging环境，522\n" +
                "替换为：服务端技术，345\n" +
                "替换为：深度学习，402\n" +
                "替换为：机器学习，193\n" +
                "替换为：log，87\n" +
                "替换为：Staging环境，522\n" +
                "替换为：环境管理，1666\n" +
                "替换为：架构，133\n" +
                "替换为：编码，164\n" +
                "替换为：异步编程，665\n" +
                "替换为：游戏引擎，135\n" +
                "替换为：react，137\n" +
                "替换为：react，137\n" +
                "替换为：直播，202\n" +
                "替换为：大数据，203\n" +
                "替换为：大数据，203\n" +
                "替换为：数据平台，224\n" +
                "替换为：资源管理，226\n" +
                "替换为：存储，99\n" +
                "替换为：性能，100\n" +
                "替换为：hive，18\n" +
                "替换为：hive，18\n" +
                "替换为：hive，18\n" +
                "替换为：hive，18\n" +
                "替换为：hive，18\n" +
                "替换为：log，87\n" +
                "替换为：hive，18\n" +
                "替换为：hive，18\n" +
                "替换为：hive，18\n" +
                "替换为：机器学习，193\n" +
                "替换为：log，87\n" +
                "替换为：数据平台，224\n" +
                "替换为：数据平台，224\n" +
                "替换为：服务端技术，345\n" +
                "替换为：服务端技术，345\n" +
                "替换为：codereview，29\n" +
                "替换为：Android，5\n" +
                "替换为：Java，4\n" +
                "替换为：部署，236\n" +
                "替换为：KSP，316\n" +
                "替换为：vue，173\n" +
                "替换为：codereview，29\n" +
                "替换为：Devops，234\n" +
                "替换为：Android，5\n" +
                "替换为：分享，995\n" +
                "替换为：编译，101\n" +
                "替换为：C++，1\n" +
                "替换为：分享，995\n" +
                "替换为：KSP，316\n" +
                "替换为：测试，337\n" +
                "替换为：分享，995\n" +
                "替换为：工具，264\n" +
                "替换为：热更新，306\n" +
                "替换为：领域驱动设计，549\n" +
                "替换为：架构，133\n" +
                "替换为：mysql，75\n" +
                "替换为：mysql，75\n" +
                "替换为：算法，160\n" +
                "替换为：音视频技术，172\n" +
                "替换为：监控报警，196\n" +
                "替换为：自动化测试，416\n" +
                "替换为：运维，362\n" +
                "替换为：IDC基础设施，1012\n" +
                "替换为：问题排查，764\n" +
                "替换为：数据平台，224\n" +
                "替换为：权限中台，591\n" +
                "替换为：权限中台，591\n" +
                "替换为：运维，362\n" +
                "替换为：iOS，3\n" +
                "替换为：异地多活，601\n" +
                "替换为：redis，27\n" +
                "替换为：redis，27\n" +
                "替换为：设计，338\n" +
                "替换为：压测，1188\n" +
                "替换为：权限中台，591\n" +
                "替换为：包大小，239\n" +
                "替换为：微服务，1783\n" +
                "替换为：数据库，114\n" +
                "替换为：稳定性，1801\n" +
                "替换为：故障演练，593\n" +
                "替换为：KFS，485\n" +
                "替换为：前端，162\n" +
                "替换为：前端，162\n" +
                "替换为：权限，1287\n" +
                "替换为：消息推送，832\n" +
                "替换为：星环平台，407\n" +
                "替换为：星环平台，407\n" +
                "替换为：稳定性，1801\n" +
                "替换为：商业化，374\n" +
                "替换为：商业化，374\n" +
                "替换为：AB实验，1301\n" +
                "替换为：linux，639\n" +
                "替换为：TypeScipt，669\n" +
                "替换为：内核，583\n" +
                "替换为：直播，202\n" +
                "替换为：Swift，606\n" +
                "替换为：稳定性保障，2034\n" +
                "替换为：直播，202\n" +
                "替换为：直播，202\n" +
                "替换为：编程语言，617\n" +
                "替换为：推荐，166\n" +
                "替换为：直播，202\n" +
                "替换为：分享，995\n" +
                "替换为：内核，583\n" +
                "替换为：内核，583\n" +
                "替换为：监控报警，196\n" +
                "替换为：Swift，606\n" +
                "替换为：异步，112\n" +
                "替换为：线程池，1009\n" +
                "替换为：Java，4\n" +
                "替换为：线程池，1009\n" +
                "替换为：问题排查，764\n" +
                "替换为：数据库，114\n" +
                "替换为：部署，236\n" +
                "替换为：小程序，695\n" +
                "替换为：小程序，695\n" +
                "替换为：移动端开发，2533\n" +
                "替换为：资源管理，226\n" +
                "替换为：资源管理，226\n" +
                "替换为：质量与研发效能，370\n" +
                "替换为：数据平台，224\n" +
                "替换为：分享，995\n" +
                "替换为：flutter，86\n";
        String input3 = "2\n" +
                "12\n" +
                "13\n" +
                "20\n" +
                "23\n" +
                "25\n" +
                "26\n" +
                "30\n" +
                "31\n" +
                "32\n" +
                "33\n" +
                "34\n" +
                "37\n" +
                "38\n" +
                "39\n" +
                "41\n" +
                "43\n" +
                "46\n" +
                "47\n" +
                "48\n" +
                "49\n" +
                "52\n" +
                "53\n" +
                "54\n" +
                "55\n" +
                "57\n" +
                "60\n" +
                "62\n" +
                "63\n" +
                "64\n" +
                "65\n" +
                "66\n" +
                "67\n" +
                "69\n" +
                "70\n" +
                "71\n" +
                "72\n" +
                "73\n" +
                "76\n" +
                "79\n" +
                "80\n" +
                "84\n" +
                "85\n" +
                "90\n" +
                "92\n" +
                "95\n" +
                "96\n" +
                "105\n" +
                "109\n" +
                "111\n" +
                "116\n" +
                "118\n" +
                "121\n" +
                "141\n" +
                "149\n" +
                "152\n" +
                "153\n" +
                "154\n" +
                "155\n" +
                "156\n" +
                "157\n" +
                "163\n" +
                "167\n" +
                "168\n" +
                "171\n" +
                "172\n" +
                "174\n" +
                "175\n" +
                "177\n" +
                "188\n" +
                "191\n" +
                "192\n" +
                "194\n" +
                "195\n" +
                "198\n" +
                "199\n" +
                "201\n" +
                "210\n" +
                "211\n" +
                "212\n" +
                "213\n" +
                "214\n" +
                "215\n" +
                "218\n" +
                "221\n" +
                "223\n" +
                "227\n" +
                "233\n" +
                "237\n" +
                "238\n" +
                "240\n" +
                "246\n" +
                "247\n" +
                "248\n" +
                "249\n" +
                "251\n" +
                "252\n" +
                "253\n" +
                "254\n" +
                "255\n" +
                "256\n" +
                "257\n" +
                "258\n" +
                "262\n" +
                "263\n" +
                "265\n" +
                "267\n" +
                "269\n" +
                "270\n" +
                "272\n" +
                "276\n" +
                "277\n" +
                "284\n" +
                "285\n" +
                "287\n" +
                "288\n" +
                "290\n" +
                "292\n" +
                "293\n" +
                "294\n" +
                "295\n" +
                "299\n" +
                "302\n" +
                "304\n" +
                "305\n" +
                "311\n" +
                "312\n" +
                "313\n" +
                "319\n" +
                "320\n" +
                "322\n" +
                "324\n" +
                "327\n" +
                "328\n" +
                "329\n" +
                "330\n" +
                "331\n" +
                "332\n" +
                "333\n" +
                "339\n" +
                "343\n" +
                "348\n" +
                "350\n" +
                "351\n" +
                "352\n" +
                "367\n" +
                "376\n" +
                "379\n" +
                "394\n" +
                "395\n" +
                "412\n" +
                "413\n" +
                "418\n" +
                "424\n" +
                "425\n" +
                "428\n" +
                "440\n" +
                "448\n" +
                "455\n" +
                "457\n" +
                "458\n" +
                "460\n" +
                "462\n" +
                "463\n" +
                "464\n" +
                "470\n" +
                "476\n" +
                "478\n" +
                "479\n" +
                "486\n" +
                "491\n" +
                "492\n" +
                "493\n" +
                "494\n" +
                "497\n" +
                "501\n" +
                "502\n" +
                "506\n" +
                "511\n" +
                "521\n" +
                "524\n" +
                "533\n" +
                "534\n" +
                "536\n" +
                "537\n" +
                "538\n" +
                "539\n" +
                "540\n" +
                "541\n" +
                "543\n" +
                "545\n" +
                "547\n" +
                "550\n" +
                "551\n" +
                "552\n" +
                "553\n" +
                "554\n" +
                "556\n" +
                "565\n" +
                "567\n" +
                "573\n" +
                "577\n" +
                "578\n" +
                "580\n" +
                "581\n" +
                "582\n" +
                "584\n" +
                "602\n" +
                "612\n" +
                "613\n" +
                "615\n" +
                "624\n" +
                "625\n" +
                "626\n" +
                "630\n" +
                "635\n" +
                "642\n" +
                "644\n" +
                "656\n" +
                "657\n" +
                "658\n" +
                "659\n" +
                "660\n" +
                "664\n" +
                "677\n" +
                "681\n" +
                "682\n" +
                "686\n" +
                "687\n" +
                "688\n" +
                "690\n" +
                "692\n" +
                "699\n" +
                "713\n" +
                "714\n" +
                "716\n" +
                "719\n" +
                "720\n" +
                "721\n" +
                "722\n" +
                "727\n" +
                "728\n" ;
        String[] inputList1 = input1.split("\n");
        String[] inputList2 = input2.split("\n|，");
        String[] inputList3 = input3.split("\n");
        String output1 = null;
        String output2 = null;
        String output3 = null;
        String removeFromTags = null;
        String removeToTags = null;
        String nvalidTags = null;
        String articleHasTwoTags = null;
        String rollbackArticle = null;
        for(int i = 0; i < inputList1.length; i++){
            output1+="WHEN "+inputList1[i]+" THEN "+inputList2[2*i+1]+"\n";
            rollbackArticle += "WHEN "+inputList2[2*i+1]+" THEN "+inputList1[i]+"\n";
            output2+="WHEN "+inputList1[i]+" THEN "+"'"+inputList2[2*i].substring(4)+"'"+"\n";
            output3+="WHEN "+inputList2[2*i+1]+" THEN follower + (select follower from ks_tag_tmp where id = "+inputList1[i]+")"+"\n";
            removeFromTags+=inputList1[i]+",";
            removeToTags+=inputList2[2*i+1]+",";
            //articleHasTwoTags+="select t1.* from (select * from ks_article_tag_relation where tag_id ="+inputList1[i]+") as t1 left join" +
            //        "(select * from ks_article_tag_relation where tag_id = "+ inputList2[2*i+1] +")as t2 on t1.id = t2.id;\n";
            articleHasTwoTags += "(t1.tag_id = "+inputList1[i]+" AND t2.tag_id != "+ inputList2[2*i+1] +") OR\n";
        }
        for(String s: inputList3){
            nvalidTags+=s+",";
        }
        for(String a : inputList1){
            for(String b : inputList2){
                if(b.equals(a)){
                    System.out.println(b);
                }
            }
        }
        //System.out.println(removeToTags);
//        System.out.println("--------------------");
        //System.out.println(removeFromTags);
//        System.out.println("--------------------");
        //System.out.println(output3);
        //System.out.println(output4);
        System.out.println(rollbackArticle);
    }


    static void get1(String s){
        String[] inputList1 = s.split("\n");
        String output = "";
        for(int i = 0; i < inputList1.length; i++){
            output+=inputList1[i]+",";
        }
        System.out.println(output);
    }

    public static void main(String[] args) {

        //run1();
        get1("1\n" +
                "150\n" +
                "152\n" +
                "11\n" +
                "12\n" +
                "18\n" +
                "93\n" +
                "31");

    }
}
